Staok/stm32_framework/STM32F207IET6_HAL_freeRTOS_Framework/CONFIG/PeriphConfigCore.h
#ifndef __PERIPHCONFIGCORE_H
#define __PERIPHCONFIGCORE_H

/*
启动：	BOOT1	BOOT0		启动区域
		  x		  0			FLASH
		  0		  1			系统储存器(ISP下载)
		  1		  1			SRAM
*/
/*_________________________________PIN MAP_________________________________________
注：以下这些外设的IO在其初始化函数内已经初始化好，不用再单独初始化
						[IO]										[描述]
外设：	* PA8												MCO输出，默认时钟源为HSE
		
		* CH1/PA6	CH2/PA7		CH3/PB0		CH4/PB1			TIM3默认PWM口
		
		  CH1/PB4	CH2/PB5		CH3/PB0		CH4/PB1			TIM3部分重映射PWM口
		  CH1/PC6	CH2/PC7		CH3/PC8		CH4/PC9			TIM3完全重映射PWM口
		  
		* TX/PA9	RX/PA10		TX/PB6		RX/PB7			USART1默认引脚和重映射引脚
		  TX/PA2	RX/PA3		TX/PD5		RX/PD6			USART2默认引脚和重映射引脚
		  TX/PB10	RX/PB11		TX/PD8		RX/PD9			USART3默认引脚和重映射引脚
		  
		* CS/PA4	CLK/PA5		MISO/PA6	MOSI/PA7		SPI1默认引脚
		  CS/PB12	CLK/PB13	MISO/PB14 	MOSI/PB15		SPI2默认引脚
		  
		* 0  1  2  3  4  5  6  7  8  9  10 11 12 13 14 15	ADC1各个通道引脚
		  A0 A1 A2 A3 A4 A5 A6 A7 B0 B1 C0 C1 C2 C3 C4 C5
		  
		* CH1/PA15	CH2/PB3		CH3/PB10	CH4/PB11		TIM2四个PWM通道
		
		* CH1/CH1N		CH2/CH2N		CH3/CH3N		CH4		BKIN	TIM8的PWM通道
		  PC6/PA7		PC7/PB0			PC8/PB1			PC9		PA6
		  
		  				CH1/CH1N		CH2/CH2N		CH3/CH3N		CH4		BKIN	TIM1的PWM通道
		* 默认			PA8/PB13		PA9/PB14		PA10/PB15		PA11	PB12
		  部分重映射	PA8/PA7			PA9/PB0			PA10/PB1		PA11	PA6
		  完全重映射	PE9/PE8			PE11/PE10		PE13/PE12		PE14	PE15
		
		* PA0												StandBy待机低功耗模式的唤醒按键WKUP（占用0线外部中断）
		
		* PA4		PA5										DAC_OUT1  DAC_OUT2（hd容量系类外设）
		
		* PC8/SDIO_D0	PC9/SDIO/D1		PC10/SDIO_D2		SDIO固定引脚，用于接SD卡
		  PC11/SDIO_D3	PC12/SDIO_CK	PD2/SDIO_CMD
		  
		* 												FSMC引脚（A[0:25],D[0:15],NEx,NOE,NWE,NBL0,NBL1）
		  D2	D3	NOE	NWE	NE1/NCE2	D13	D14 D15 	A16 	A17 	A18 	D0 		D1
		  PD0	PD1	PD4	PD5	PD7			PD8	PD9	PD10	PD11	PD12	PD13	PD14	PD15
		  
		  NBL0	NBL1	A23	A19	A20	A21	A22	D4	D5	D6	D7		D8		D9		D10		D11		D12
		  PE0	PE1		PE2	PE3	PE4	PE5	PE6	PE7	PE8	PE9	PE10	PE11	PE12	PE13	PE14	PE15
		  
		  A0	A1	A2	A3	A4	A5	A6		A7		A8		A9		A10	A11	A12	A13	A14	A15
		  PF0	PF1	PF2	PF3	PF4	PF5	PF12	PF13	PF14	PF15	PG0	PG1	PG2	PG3	PG4	PG5
		  
		  NE2/NCE3	NCE4_1/NE3	NCE4_2	NE4		A24		A25
		  PG9		PG10		PG11	PG12	PG13	PG14
		  
		* ...TODO:DCMI、USB、CAN等外设的IO还没有列出


用户：	*
*/

/*_______________________________复用资源介绍___________________________________________

GPIO的AF复用功能完整表在 “stm32f207ie.pdf” 的 59页 开始

DMAx的数据流和通道分配完整表在 “寄存器手册-cd00225773-stm32f205xx-stm32f207xx-stm32f215xx-and-stm32f217xx-advanced-armbased-32bit-mcus-stmicroelectronics”
			的 180页 开始

*/

/*_______________________________外设资源介绍___________________________________________
	STM32F207IET6：
		512KB(hd)FLASH，128KB（SRAM1）+112KB+16KB（SRAM2）RAM，176脚LQFP封装，140个GPIO，-40~85℃
	
	时钟分配：
		HSE外接25Mhz晶振，LSE外接32.768Khz晶振
		开启HSE（25M）、LSE（32.768K）和LSI（32K），关闭HSI（16M）
		PLLCLK = SYSCLK = AHBCLK = HCLK 均为120MHz，APB2外设为60MHz，APB1外设为30Mhz，APB2定时器为120MHz，APB1定时器为60Mhz
		
		ETH\RNG\FSMC\USB FS\USB HS\GPIO\DMA 均在120M
		RTC 时钟取自 LSE = 32.768K
		IWDG时钟取自 LSI = 32K
		DCMI 48 Mbyte/s max
		
		APB2外设(60M)：SDIO\USART1\USART6\SPI1\ADC123
		APB2定时器(120M)：TIM1 TIM8 TIM9 TIM10 TIM11
		APB1外设(30M)：USART2\USART3\UART4\UART5\SPI2、I2S2\SPI3、I2S3\I2C123\CAN12\DAC12
		APB1定时器(60M)：TIM2 TIM3 TIM4 TIM5 TIM12 TIM13 TIM14
	
		定时器不管16或者32位的，都按16位来用，也很够了
	本框架TIM分配：
		TIM4	10ms时基，用户不可写中断程序
		TIM3	产生辅助PWM，可中断提供辅助时基，通道按照其他外设使用情况灵活分配
		TIM2	多功能使用，可中断提供辅助时基，通道可用于PWM、正交编码解码、输入捕获
		TIM5	同上
		TIM1\8	主PWM，产生3对互补、带死区、带刹车和电平可调的PWM
		TIM6\7	官方推荐用于触发DAC（也可产生三角波）或者产生额外时基
	
*/

/*_______________________________外设优先级划分___________________________________________*/
/*
优先级分组为4，只有0~15的16级抢占优先级


优先级	0			1				2				3				4				5				...
	   保留	    TIM4(时基)	 	按键外部中断	按键外部中断	TIM6(辅助时基)
											    TIM3（PWNM）	TIM7(辅助时基)
											    TIM2（多功能）   
*/

/*
   	CPU内部 FLASH  			【0x0800 0000 - 0x080F FFFF】,容量512K(0x80000)字节
	CPU内部 SRAM1  			【0x2000 0000 - 0x2000 FFFF】,容量128K(0x20000)字节
	
	外部扩展SRAM 在块1区3   【0x6800 0000 - 0x681F FFFF】,容量1MB(0x100000)字节（512K个16bit）
	TFT LCD 地址 在块1区4   【0x6C000000 | 0x000007FE,  +2】, 仅占用2个端口地址（使用A10连接RS引脚）TODO：改为A0
*/

/*________________________________模板固定搭配____________________________________________*/
/*所有main的头文件都放在这里*/
#include "sysVar.h"								/*定义系统级常用的变量、数据类型和二进制表示宏*/
#include "stm32f2xx.h"
#include "stm32f2xx_hal.h"						/*在里面的stm32f2xx_hal_conf.h里面选择用哪些外设的HAL库——————！按需要进行修改！*/

#include "malloc.h"							/*借鉴的 内存管理 章节的源代码自实现的malloc和free*/	
#include "sys_menu.h"							/*模板固定搭配！必须开启！提供一个菜单模板，把系统的输入、输出、执行功能的标志位控制全部打包！相当于io_ctrl*/
#include "MyString.h"							
												/*模板固定搭配！必须开启！提供一个实现了string.h大部分字符操作函数的库
													具体API看MyString.c文件里的注释
													int mystrlen (const char *str);
													char * mystrcat (char *dest, const char *src);
													char * mystrncat (char *dest, const char *src, int n);
													char * mystrcpy (char *dest, const char *src);
													char * mystrncpy (char *dest, const char *src, int n);
													int mystrcmp (const char *s1, const char *s2);
													int mystrncmp (const char *s1, const char *s2, int n);
													void * mymemset (void *s, int c, unsigned n);
													void *mymemcpy(void *des,const void *src,size_t len);
													char *mystrtok(char *s, const char *delim);*/
int myatoi(const char *str);					/*提供一个字符串转整形的实现*/
unsigned char BCD2HEX(unsigned char bcd_data); 	//提供BCD转为HEX子程序
unsigned char HEX2BCD(unsigned char hex_data); 	//提供HEX转为BCD子程序
#include "printf.h"								
												/*模板固定搭配！必须开启！包含且编译printf.h，github开源文件，无依赖，功能比较全。
													约占6KB，对于stm32够，对于其他小容量MCU则看“其他几个sprintf实现”文件夹里面的,不要纠结了。
													开源仓库地址：https://github.com/mpaland/printf
													提供API：
													int printf(const char* format, ...); 								不用
													int printf_uart(unsigned char uart,const char* format, ...); 		用，可选发送串口
																		串口选择可选：UART1/UART2/UART3，需要先使能相关串口
													int sprintf(char* buffer, const char* format, ...); 				不带字节数量限制
													int snprintf(char* buffer, size_t count, const char* format, ...); 	带字节数量限制，更安全
												注意：另在Middlewares文件夹内提供strprintf.h，功能比较单一，但很小。*/
#define STSTEM_TIM4_ENABLE		1				/*模板固定搭配！必须开启！使用通用定时器4，提供时基，默认10ms周期中断*/
#define STSTEM_TIM3PWM_ENABLE	1				/*模板基本功能，必须开启！使用通用定时器3，默认不开启中断，提供四路PWM输出*/
												/*默认通道4给蜂鸣器，蜂鸣器低电平有效！蜂鸣器控制需要用到TIM4！
												改变占空比可调响度，改变频率可调声调*/
												/*默认向上计数，输出极性为LOW，PWM1模式，即设置为当计数值小于此值时输出低电平。*/
												/*默认：引脚上拉							(CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)*/
		#define STSTEM_TIM3PWM_REMAP_PARTIAL	0	/*定时器3部分引脚重映射，Partial remap  (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)*/
		#define STSTEM_TIM3PWM_REMAP_ENABLE		0	/*定时器3全部引脚重映射，Full remap     (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)*/
		#define STSTEM_TIM3PWM_CHANNEL_ENABLE	(B0000_1000) /*输出通道选择，共四个通道*/
													/*可选  B0000_0001|B0000_0010|B0000_0100|B0000_1000	*/
		#define TIM3PWM_BuzzerCh				TIM3PWM_Channel_4	//选择用于蜂鸣器的PWM通道
		#define STSTEM_TIM3PWM_TI_ENABLE		0	/*是否开启定时器3的定时中断，除非急需用，否则一般不开*/
		
		#define tim3prsc STSTEM_TIM3PWM_Period_5K		/*选择定时器输出频率，以下六条语句基本不动（重装值为1000，这里是选择预分频系数）*/
			#define STSTEM_TIM3PWM_Period_2K	(30-1)
			#define STSTEM_TIM3PWM_Period_5K	(12-1)
			#define STSTEM_TIM3PWM_Period_10K	(6-1)
			#define STSTEM_TIM3PWM_Period_20K	(3-1)
			#define STSTEM_TIM3PWM_Period_60K	(1-1)
			#define tim3arr 1000-1
		/*可用API：
					HAL_TIM_PWM_Start(&TIM3_Handler,TIM_CHANNEL_2);		开启TIM3的PWM通道2
					HAL_TIM_PWM_Stop(&TIM3_Handler,TIM_CHANNEL_2);		关闭TIM3的PWM通道2，但看源码好像使所有通道都关闭了，待实验
					
					设置TIM3的PWM通道2的占空比百分数为88.8%，值需在0~100.0之间。即88.8%的低电平时间（本模板规范：低电平有效，即用电器工作电压）
					TIM3_set_Channel_Pulse(TIM3PWM_Channel_2,88.8);
					
					buzzer_bibi_once;			用户使用，蜂鸣器叫唤一声
					define buzzer_bibi_on;		用户使用，蜂鸣器间歇叫唤开启
					define buzzer_bibi_off;		用户使用，蜂鸣器间歇叫唤关闭
		*/


/*_____________________________________\\\                               ///____________________________________________*
 *___________________________________________________组件选择___________________________________________________________*
 *_____________________________________///                               \\\____________________________________________*/
#define SYSTEM_SUPPORT_pid		0				/*提供一个pid算法实现库，集成了积分分离和变限积分，以及可选的不完全微分和微分先行，具体用法看pid.h里面*/
												/*里面另提供一个一阶低通滤波实现函数*/
												/*一阶低通滤波器 float FirstOrderLPF(float NewValue);*/												
	#if SYSTEM_SUPPORT_pid						/*如果不包含，其他文件就无法调用此组件的API*/
		#include "pid.h"
	#endif

