Staok/stm32_framework/STM32F207IET6_HAL_freeRTOS_Framework/CONFIG/PeriphConfigCore.h
/*hd系列外设，基本定时器6、7，只能用于定时中断，提供更多的同步功能*/
#define STSTEM_TIM6_ENABLE		1
	#define tim6arr STSTEM_TIM6_Period_5K			/*选择定时器6输出频率（预分频系数为60，这里选择重装值）*/
		#define STSTEM_TIM6_Period_1K	(1000-1)
		#define STSTEM_TIM6_Period_2K	(500-1)
		#define STSTEM_TIM6_Period_5K	(200-1)
		#define STSTEM_TIM6_Period_10K	(100-1)
		#define STSTEM_TIM6_Period_20K	(50-1)
		#define STSTEM_TIM6_Period_50K	(20-1)
		#define STSTEM_TIM6_Period_100K	(10-1)
		#define STSTEM_TIM6_Period_200K	(5-1)
#define STSTEM_TIM7_ENABLE		1
	#define tim7arr STSTEM_TIM6_Period_5K			/*选择定时器7输出频率（预分频系数为60，这里选择重装值）*/
		#define STSTEM_TIM7_Period_1K	(1000-1)
		#define STSTEM_TIM7_Period_2K	(500-1)
		#define STSTEM_TIM7_Period_5K	(200-1)
		#define STSTEM_TIM7_Period_10K	(100-1)
		#define STSTEM_TIM7_Period_20K	(50-1)
		#define STSTEM_TIM7_Period_50K	(20-1)
		#define STSTEM_TIM7_Period_100K	(10-1)
		#define STSTEM_TIM7_Period_200K	(5-1)
/*
	关闭定时中断：（先清除中断标志位，再关闭中断）
		__HAL_TIM_CLEAR_IT(&TIM6_Handler, TIM_IT_UPDATE);
		HAL_TIM_Base_Stop_IT(&TIM6_Handler);
		
		__HAL_TIM_CLEAR_IT(&TIM76_Handler, TIM_IT_UPDATE);
		HAL_TIM_Base_Stop_IT(&TIM7_Handler);
		
		注： __HAL_TIM_CLEAR_FLAG(&TIM6_Handler,TIM_FLAG_UPDATE);和
			 __HAL_TIM_CLEAR_IT(&TIM6_Handler, TIM_IT_UPDATE);效果应该一样
*/


/*对于ADC和DAC，如果Vref+连接到3.0V基准，则要修改程序！*/
/*hd系列外设，DAC两个输出通道 PA4和PA5，默认初始化为12位右对齐，速度最快为250K左右，输出范围 0~Vref+，默认Vref+为3.3V，否则自行更改转换计算*/
/*可选输出 噪声波形 和 三角波波形 ，默认不适用外部触发，可选触发源在初始化函数中修改（有定时器中断和外部中断线9）*/
#define SYSTEM_DAC_OUT1_ENABLE	0
#define SYSTEM_DAC_OUT2_ENABLE	0
/*可用API:
	设置通道1输出电压,vol:0~3.30V
		void DAC_Set_Ch1_Vol(float vol)
	设置通道2输出电压,vol:0~3.30V
		void DAC_Set_Ch2_Vol(float vol)
*/

/*	对于ADC和DAC，如果Vref+连接到3.0V基准，则要修改程序！
	ADC：STN32的是12位逐次逼近型，分ADC1、2和3，其中ADC1和ADC2的引脚一样（除了内部通道）；
	最大速率1MHz，1us（在AD时钟14MHz（最高），采样时间为1.5个周期得到），总转换时间为 (采样时间 + 12.5个周期)，采样时间长则采样精度高；
	参考电压 Vref-必须连到VSSA，Vref+可连到 2.4V~VDDA，ADC输入电压必须小于Vref+，默认Vref+为3.3V，否则自行更改转换计算
	ADC1本质就是一个AD转换器加16路选择器，所以ADC1同一时刻采样值只能是一个，如果用在规则组中扫描模式，无法得知当前结果是哪一路的，一个AD模块一个值
	ADC1的通道与引脚映射：
	通道：	0	1	2	3	4	5	6	7	8	9	10	11	12	13	14	15	   16		     17
	IO	：	A0	A1	A2	A3	A4	A5	A6	A7	B0	B1	C0	C1	C2	C3	C4	C5	内部温度	内部参考电压
*/
#define SYSTEM_ADC1_ENABLE		1			/*启否ADC1*/
	#define SYSTEM_ADC1_useScan		1		/*启否规则组的连续扫描，如果启用，则把下面定义的所有通道都放到规则组里，并使用DMA2 Stream0的通道0把转换结果放到目标位置
												如果不启用，则为软件触发的单次转换*/
		#define SYSTEM_ADC1_useCircular	1	/*只在扫描模式下有效；开启则自动循环ADC转换，只需要判断标志位和读数即可，不需要软件手动触发开启一次ADC转换*/
	#define SYSTEM_ADC1_useChanlNum	4		/*定义共用多少路通道*/
	#define SYSTEM_ADC1_useChanl	B1in16|B4in16|B5in16|InrTemp /*定义共用哪些通道，可写B1in16~B15in16（分别代表通道0~14），和InrTemp(内部温度通道)
														（第16个ADC1通道留作内部温度标志所以不可用）*/
													/*如果只用采集内部温度，而不用其他通道，应设置：SYSTEM_ADC1_useChanlNum为1  SYSTEM_ADC1_useChanl单设为InrTemp*/
		#define InrTemp B16in16
		extern u16 adValue[SYSTEM_ADC1_useChanlNum];/*扫描模式下DMA1把ADC转换结果传送的目标位置*/
		extern u8 adValueDone; 						/*扫描模式下转换完成标志*/
/*可用的API：返回的都是原始ADC值
		凡是启用 SYSTEM_ADC1_useScan 扫描模式，即触发一次，自动扫描所有规则组里的通道————适合快速
					自动用DMA2 Stream0的通道0发送到adValue[]，并置位adValueDone
			读取顺序：
				调用 HAL_ADC_Start_DMA(&ADC1_Handler, (uint32_t*)&adValue,SYSTEM_ADC1_useChanlNum); 一次则开启一次规则组全部通道的转换
					调用1次则把规则组所有通道转换一遍，然后判断标志位adValueDone等着在adValue[]取数就行了
				如果 SYSTEM_ADC1_useCircular 打开：只需要执行一次！一次！ HAL_ADC_Start_DMA(&ADC1_Handler, (uint32_t*)&adValue,SYSTEM_ADC1_useChanlNum); 即可
				
				判断 adValueDone 是否为1，是则从 adValue[x] 读值即可，如果启用 内部温度 通道，其值保存在adValue[SYSTEM_ADC1_useChanlNum-1]
				读取完后对 adValueDone 清零
				停止转换为 HAL_ADC_Stop_DMA(&ADC1_Handler);
				例子：
					char ADC_buf[20];
					if(adValueDone)
					{
						adValueDone = 0;
						//HAL_ADC_Stop_DMA(&ADC1_Handler);
						sprintf(ADC_buf,"adValue:%d %d %d",adValue[0],adValue[1],adValue[2]);
						LCD_ShowString(10,180,16,(u8*)ADC_buf,0);
					}
		凡是没有启动 SYSTEM_ADC1_useScan 一次触发一个通道并手动取数————适合慢速
			读取顺序：
				调用 u32 Get_Adc_Average(u32 ch,u8 times); 返回值为本次ADC值
				其中 ch 通道 形参选择想转换的通道，可选ADC_CHANNEL_0~15，可以为ADC_CHANNEL_TEMPSENSOR，其中result[0]保存本次本通道的转换结果
				例子：
					adValue[0] = (u16)Get_Adc_Average(ADC_CHANNEL_0,10);
					adValue[1] = (u16)Get_Adc_Average(ADC_CHANNEL_3,10);
					adValue[2] = (u16)Get_Adc_Average(ADC_CHANNEL_4,10);
					sprintf(ADC_buf,"adValue:%d %d %d",adValue[0],adValue[1],adValue[2]);
					LCD_ShowString(10,180,16,(u8*)ADC_buf,0);
				
		注意：采集温度通道返回的是ADC的原始值，用 float Get_Temprate(u32 adcx) 把原始值转换为实际温度值(float类型)
*/


/*开启硬件SPI，x8/xB系列有两个SPI，最高18M位每秒
默认：尽量只用其中一个，多个器件用多个SS使能端，不提供引脚重映射，默认一次发送八位bits数据，SS引脚用户单独定义！
		master模式，MSB First，SS低电平选中器件
		SCK空闲时刻为高电平(时钟极性CPOL=1)（默认）：
			若使用第二跳变沿数据被采样(时钟相位CPHA=1)：数据线在 SCK 的偶数边沿采样（默认）
			若使用第一跳变沿数据被采样(时钟相位CPHA=0)：数据线在 SCK 的奇数边沿采样
引脚：
	SPI1->CS	SPI1->CLK	SPI1->MISO	SPI1->MOSI 	—————— 	SPI2->CS	SPI2->CLK	SPI2->MISO	SPI2->MOSI
	PA4			PA5			PA6			PA7					PB12		PB13		PB14		PB15
*/
#define SYSTEM_SPI1_ENABLE		0		/*使能SPI1*/
#define SYSTEM_SPI2_ENABLE		0		/*使能SPI2*/
/*提供API：
	用户自定SS引脚：
		到PeriphConfig.c里面的
			sys_SPI1_SS_io_Init();		自行更改
			sys_SPI2_SS_io_Init();		自行更改
		以及 到PeriphConfig.h里面的
			#define	SPI1_CS PAout(4)	自行更改
			#define	SPI2_CS PBout(12)	自行更改
	写读函数：(目前只写了SPI1，SPI2如果要用的话同理)
		u8 SPI1_ReadWriteByte_8Byte(u8 TxData) 		读写一个字节
		u8 SPI1_ReadWriteByte_16Byte(u8* TxData) 	连写两个字节并读回，传入一个包含2字节的u8*指针
		u8 SPI1_WriteByte_8Byte(u8 TxData)			写一个字节
		u8 SPI1_WriteByte_16Byte(u8* TxData)		连写两个字节，传入一个包含2字节的u8*指针
		例子：
			u8 Max7219_adr_data[Max7219_regNum][2] = 
			{
				{0x09,0xFF},
				{0x0A,0x08},
				...
			}
			for(i = 0;i < Max7219_regNum;i++)
				SPI1_WriteByte_16Byte(Max7219_adr_data[i]);
	
	设置SPI速度函数：参数可选：
					SPI_BAUDRATEPRESCALER_2 SPI_BAUDRATEPRESCALER_4 SPI_BAUDRATEPRESCALER_8 SPI_BAUDRATEPRESCALER_16 
					SPI_BAUDRATEPRESCALER_32 SPI_BAUDRATEPRESCALER_64 SPI_BAUDRATEPRESCALER_128 SPI_BAUDRATEPRESCALER_256
		void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler);	//SPI1由APB2(60M)分频得来
		void SPI2_SetSpeed(u8 SPI_BaudRatePrescaler);	//SPI2由APB1(30M)分频得来
*/


/*低功耗模式：
睡眠： WFI操作进入，任意中断恢复，CPU时钟关，其他外设时钟维持																		（不可用）
停止：HSI、HSE时钟关，电压调节器开关需设置，任一外部中断唤醒，典型电流值为20uA														（不可用）
待机：HSI、HSE时钟关，电压调节器关，SRAM和寄存器内容丢失，仅电源控制寄存器和备份区域不受影响
		唤醒条件：WKUP按键上升沿，RTC警告事件，复位按键，看门狗复位（！），典型电流值为2uA，为三个模式中最低 	类似于开关机		（可用）
		WKUP 在PA0
*/
#define SYSTEM_StdbyWKUP_ENABLE	0		/*使用待机-低功耗模式（占用0线外部中断）*/
										/*注：看门狗和低功耗待机模式不能同时开启，因为看门狗不能关闭，看门狗复位会唤醒低功耗状态*/
/*当启用 SYSTEM_StdbyWKUP_ENABLE 后，PA0作为WKUP按键，默认长按3秒进入待机状态，再次按下则恢复，进入待机模式函数在PA0的外部中断里*/
//对于PA0，按下为高电平，按下3s后松开，延时一秒（给时间做保存数据等关机前的准备）后进入待机状态（关机），再次按下开机
/*WKUP IO不用外接下拉电阻，在配置时STM32内部已经下拉*/
/*使用说明：
	当启用FreeRTOS时，是循环检测PA0是否为高电平持续3s，需要在任务里放一个检测函数：sys_CheckWKUP_4RTOS()，已经放了
	当使用裸机时，PA0被设置为上升沿外部中断，在外部中断中执行检测高电平是否持续3s，外部中断线0中已经放了
	需要在Sys_Enter_Standby()函数里放一些关机前的准备工作事务
*/



