Staok/stm32_framework/STM32F207IET6_HAL_freeRTOS_Framework/CONFIG/PeriphConfigCore.h
/*_______________________________CRC___________________________________*/
#if SYSTEM_CRC_ENABLE
	#define BUFFER_SIZE    114
	extern CRC_HandleTypeDef hcrc;
	extern const uint32_t aDataBuffer[BUFFER_SIZE];
	extern uint32_t uwExpectedCRCValue;
	void sys_CRC_ENABLE(void);
	void HAL_CRC_MspInit(CRC_HandleTypeDef* hcrc);
#endif
/*_______________________________RTC___________________________________*/
#if SYSTEM_RTC_ENABLE
	extern RTC_HandleTypeDef RTC_Handler;  //RTC句柄

	void sys_RTC_Enable(void);						/*RTC配置*/

#endif

/*_______________________________定时器2___________________________________*/
#if STSTEM_TIM2_ENABLE
	extern TIM_HandleTypeDef TIM2_Handler;
	void sys_TIM2_ENABLE(void); //写在预编译外面为了外部文件能够调用
	#if (STSTEM_TIM2_asPWMorCap == 0)
		/*PWM私有变量*/
		#define TIM2PWM_Channel_1	1
		#define TIM2PWM_Channel_2	2
		#define TIM2PWM_Channel_3	3
		#define TIM2PWM_Channel_4	4
		extern TIM_OC_InitTypeDef 	TIM2_CH1Handler,TIM2_CH2Handler,TIM2_CH3Handler,TIM2_CH4Handler;
		void TIM2_set_Channel_Pulse(u8 channel,float percent);
	#elif (STSTEM_TIM2_asPWMorCap == 1)
		/*输入捕获私有变量*/
		extern u8  	TIM2CHx_CAPTURE_STA;	    				
		extern u16	TIM2CHx_CAPTURE_VAL;
		float Peek_TIM2_Cap_Val(void);
		extern TIM_IC_InitTypeDef TIM2_CHxConfig;
		void Process_TIM2_IC_CallBack_Channel_1(void);
		void Process_TIM2_IC_CallBack_Channel_2(void);
		void Process_TIM2_IC_CallBack_Channel_3(void);
		void Process_TIM2_IC_CallBack_Channel_4(void);
	#elif (STSTEM_TIM2_asPWMorCap == 3)
		/*正交解码私有变量*/
		extern TIM_Encoder_InitTypeDef sEncoderConfig;
		extern int32_t EncoderOverflowCount;//定时器溢出次数
		float peek_TIM2_Encoder_Speed(void);
		int32_t peek_TIM2_Encoder_Value(void);
	#endif
#endif

/*_______________________________TIM1PWM___________________________________*/

#if STSTEM_TIM1PWM_ENABLE
		void sys_TIM1PWM_ENABLE(void);
		extern TIM_HandleTypeDef TIM1_Handler;
		#define TIM1PWM_Channel_1	1
		#define TIM1PWM_Channel_2	2
		#define TIM1PWM_Channel_3	3
		#define TIM1PWM_Channel_4	4
		void TIM1_set_Channel_Pulse(u8 channel,float percent);
#endif

/*_______________________________TIM1PWM___________________________________*/

#if STSTEM_TIM8PWM_ENABLE
		extern TIM_HandleTypeDef TIM8_Handler;
		void sys_TIM8PWM_ENABLE(void);
		#define TIM8PWM_Channel_1	1
		#define TIM8PWM_Channel_2	2
		#define TIM8PWM_Channel_3	3
		#define TIM8PWM_Channel_4	4
		void TIM8_set_Channel_Pulse(u8 channel,float percent);
#endif

/*_______________________________TIM6___________________________________*/

#if STSTEM_TIM6_ENABLE
	void sys_TIM6_ENABLE(void);
	extern TIM_HandleTypeDef TIM6_Handler;
#endif
/*_______________________________TIM7___________________________________*/

#if STSTEM_TIM7_ENABLE
	void sys_TIM7_ENABLE(void);
	extern TIM_HandleTypeDef TIM7_Handler;
#endif


/*_______________________________ADC1___________________________________*/

#if SYSTEM_ADC1_ENABLE
	//void ADC_RegularChannelConfig(ADC_HandleTypeDef *AdcHandle, uint32_t Channel, uint32_t Rank, uint32_t SamplingTime);
	//u16 Get_Adc(u32 ch);
	#if SYSTEM_ADC1_useScan
		extern DMA_HandleTypeDef  ADC1rxDMA_Handler;
		void ADC_DMA_Cfg(void);
	#endif
	
	extern ADC_HandleTypeDef ADC1_Handler;
	void sys_ADC1_ENABLE(void);
	u32 Get_Adc_Average(u32 ch,u8 times);
	float Get_Temprate(u32 adcx);
#endif

/*_______________________________SPI1、2________________________________*/

#if (SYSTEM_SPI1_ENABLE) || (SYSTEM_SPI1_ENABLE)
extern SPI_HandleTypeDef SPI1_Handler;  //SPI1句柄
extern SPI_HandleTypeDef SPI2_Handler;  //SPI2句柄
void sys_SPI1_ENABLE(void);
void sys_SPI2_ENABLE(void);
void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler);
void SPI2_SetSpeed(u8 SPI_BaudRatePrescaler);

//写读8字节
u8 SPI1_ReadWriteByte_8Byte(u8 TxData);
//写读16字节，传入一个包含2字节的u8*指针
u8 SPI1_ReadWriteByte_16Byte(u8* TxData);
//写8字节
u8 SPI1_WriteByte_8Byte(u8 TxData);
//写16字节，传入一个包含2字节的u8*指针
u8 SPI1_WriteByte_16Byte(u8* TxData);

u8 SPI2_ReadWriteByte(u8 TxData);

void sys_SPI1_SS_io_Init(void);
void sys_SPI2_SS_io_Init(void);

#endif
/*_________________________________低功耗StandbyMode________________________________*/

#if SYSTEM_StdbyWKUP_ENABLE
	void sys_StdbyWKUP_ENABLE(void);
	void sys_CheckWKUP_4RTOS(void);
	#define WKUP_KD HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)  //PA0 检测是否外部WK_UP按键按下
	u8 Check_WKUP(void);  			//检测WKUP脚的信号
	void Sys_Enter_Standby(void);	//系统进入待机模式
#endif

/*____________________________FLASH编程___________________________________*/

#if SYSTEM_FLASH_IAP_ENABLE
	void STMFLASH_Read(		u32 ReadAddr,	u16 *pBuffer,	u16 NumToRead);		//可用API
	void STMFLASH_Write(	u32 WriteAddr,	u16 *pBuffer,	u16 NumToWrite);	//可用API
	#if STM32_FLASH_WREN	//如果使能了写   
		extern void FLASH_PageErase(uint32_t PageAddress);
		void STMFLASH_Write_NoCheck(u32 WriteAddr,u16 *pBuffer,u16 NumToWrite);
	#endif

	u16 STMFLASH_ReadHalfWord(u32 faddr);
#endif

/*_____________________________________DAC________________________________________*/

#if ((SYSTEM_DAC_OUT1_ENABLE) || (SYSTEM_DAC_OUT2_ENABLE))
	extern DAC_HandleTypeDef DAC1_Handler;//DAC句柄
	void sys_DAC_ENABLE(void);
	//void HAL_DAC_MspInit(DAC_HandleTypeDef* hdac);
	void DAC_Set_Ch1_Vol(float vol);
	void DAC_Set_Ch2_Vol(float vol);
#endif



/*____________________SDIO SD_____________________________________________*/

#if SYSTEM_SDIO_SD_ENABLE
	extern HAL_SD_CardInfoTypeDef  	SDCardInfo;              	//SD卡信息
	extern HAL_SD_CardCIDTypeDef	SDCard_CID;					//SD卡CID信息
	extern SD_HandleTypeDef        	SDCARD_Handler;     		//SD卡句柄
	#define SD_TIMEOUT 			((uint32_t)100000000)  			//超时时间

	u8 SD_Init(void);
	u8 SD_ReadDisk(u8* buf,u32 sector,u32 cnt);
	u8 SD_WriteDisk(u8 *buf,u32 sector,u32 cnt);
	void show_sdcard_info(void);						//通过串口1打印SD卡相关信息

#endif

/*____________________________FSMC for SARM_____________________________________________*/
#if ((SYSTEM_FSMC_ENABLE) && (SYSTEM_FSMC_use4SRAM))

	extern SRAM_HandleTypeDef SRAM_Handler;    //SRAM句柄
	//使用NOR/SRAM的 Bank1.sector3,地址位HADDR[27,26]=10 
	//对IS61LV25616/IS62WV25616,地址线范围为A0~A17 
	//对IS61LV51216/IS62WV51216,地址线范围为A0~A18
	#define SRAM1_BANK3_ADDR    ((u32)(0x68000000))	//计算： (0x6000 0000 | ((u32)64*1024*1024*(3 - 1)))

	void sys_FSMC_SRAM_ENABLE(void);
	void FSMC_SRAM_WriteBuffer(u8 *pBuffer,u32 WriteAddr,u32 n);
	void FSMC_SRAM_ReadBuffer(u8 *pBuffer,u32 ReadAddr,u32 n);

#endif


/*____________________________FSMC for LCD_____________________________________________*/
#if ((SYSTEM_FSMC_ENABLE) && (SYSTEM_FSMC_use4LCD))
	extern SRAM_HandleTypeDef TFTSRAM_Handler;    //SRAM句柄(用于控制LCD)

	void LCD_with_FSMC_init_FSMC(void);
	//LCD地址结构体
	typedef struct
	{
		vu16 LCD_REG;
		vu16 LCD_RAM;
	} LCD_TypeDef;
	//使用NOR/SRAM的 Bank1.sector4,地址位HADDR[27,26]=11 A10作为数据命令区分线 
	//注意设置时STM32内部会右移一位对其! 			    
	#define LCD_BASE        ((u32)(0x6C000000 | 0x000007FE))
	#define LCD             ((LCD_TypeDef *) LCD_BASE)
#endif


#define Version_of_stm32_framework "2.3"

/*Author:		MaxwellXyao*/
#define BIT(n) 					(1 << n) 				//位mask
#define bit_SetTrue(x,mask) 	(x |= mask)				//该位设置为真
#define bit_SetFalse(x,mask)	(x &= ~mask)			//该位设置为假
#define bit_Toggle(x,mask) 		(x ^= mask)				//位切换
#define bit_IsTrue(x,mask) 		((x & mask) != 0)		//该位是否真
#define bit_IsFalse(x,mask) 	((x & mask) == 0)		//该位是否假

//以下为汇编函数
void WFI_SET(void);				//执行WFI指令
void INTX_DISABLE(void);		//关闭所有中断
void INTX_ENABLE(void);			//开启所有中断
void MSR_MSP(uint32_t addr);	//设置堆栈地址

#endif




